espressif/esp-matter/examples/door_lock/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"

# Enable BLE Host but use remote controller
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_ENABLE_BT=y

# Increase main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Disable Wi-Fi Soft AP
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Do not deinit BLE after commissioning
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# ESP32-P4 Function EV Board use ESP32C6 as slave device
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# BSP button
CONFIG_BSP_BUTTON_1_GPIO=35
